Script test/Performance Test/jmeter/scripts/PT-TC02_ApprovalFlow_LoadTest.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  PT-TC02: Test Chịu Tải Luồng Phê Duyệt & Kafka
  Module: REQ + WF SERVICE - Thanh phụ trách
  API: POST /api/v1/job-service/recruitment-requests/approve/{id}
  Target: 100 Managers/Directors approve simultaneously
  NFR: No Deadlock, Kafka không nghẽn, Error Rate < 1%
-->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="[PT-TC02] Test Chiu Tai Luong Phe Duyet va Kafka" enabled="true">
      <stringProp name="TestPlan.comments">Performance Test - Approval Flow + Kafka
Module: REQ + WF SERVICE (Thanh)
NFR: No Deadlock | Kafka no congestion | Error Rate &lt; 1%</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
          </elementProp>
          <elementProp name="PROTOCOL" elementType="Argument">
            <stringProp name="Argument.name">PROTOCOL</stringProp>
            <stringProp name="Argument.value">http</stringProp>
          </elementProp>
          <elementProp name="AUTH_URL" elementType="Argument">
            <stringProp name="Argument.name">AUTH_URL</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
          </elementProp>
          <elementProp name="AUTH_PORT" elementType="Argument">
            <stringProp name="Argument.name">AUTH_PORT</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- CSV Data Set: Approver credentials -->
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV - Approver Credentials (jwt_tokens.csv)" enabled="true">
        <stringProp name="delimiter">,</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="filename">../csv/jwt_tokens.csv</stringProp>
        <boolProp name="ignoreFirstLine">true</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="variableNames">username,password,role</stringProp>
        <stringProp name="shareMode">shareMode.thread</stringProp>
        <stringProp name="TestPlan.comments">Each thread gets unique approver credentials. shareMode=thread ensures isolation.</stringProp>
      </CSVDataSet>

      <!-- CSV Data Set: Pending Request IDs -->
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV - Pending Request IDs (approval_data.csv)" enabled="true">
        <stringProp name="delimiter">,</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="filename">../csv/approval_data.csv</stringProp>
        <boolProp name="ignoreFirstLine">true</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="variableNames">request_id,approver_notes</stringProp>
        <stringProp name="shareMode">shareMode.thread</stringProp>
        <stringProp name="TestPlan.comments">Each thread gets unique PENDING request_id to avoid collision/deadlock. Must be pre-seeded in DB.</stringProp>
      </CSVDataSet>

      <!-- ============================================================ -->
      <!-- SETUP: Login to get JWT Token                               -->
      <!-- ============================================================ -->
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="[SETUP] Login - Get JWT Token" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
      </SetupThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/v1/auth/login - Get Token" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"username": "admin", "password": "admin123"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${AUTH_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${AUTH_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/auth/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <!-- Extract JWT token from login response -->
          <JSONPathExtractor guiclass="JSONPathExtractorGui" testclass="JSONPathExtractor" testname="Extract JWT Token" enabled="true">
            <stringProp name="JSONPathExtractor.referenceName">jwt_token</stringProp>
            <stringProp name="JSONPathExtractor.jsonPathExpr">$.data.accessToken</stringProp>
            <stringProp name="JSONPathExtractor.defaultValue">TOKEN_NOT_FOUND</stringProp>
            <stringProp name="JSONPathExtractor.match_no">0</stringProp>
            <stringProp name="TestPlan.comments">Extracts Bearer token from login response. Stored as ${jwt_token}</stringProp>
          </JSONPathExtractor>
          <hashTree/>
          <BeanShellAssertion guiclass="BeanShellAssertionGui" testclass="BeanShellAssertion" testname="Save Token to Properties" enabled="true">
            <stringProp name="BeanShellAssertion.query">
              String token = vars.get("jwt_token");
              if (token == null || token.equals("TOKEN_NOT_FOUND")) {
                  Failure = true;
                  FailureMessage = "Login failed - JWT token not extracted";
              } else {
                  props.put("GLOBAL_JWT_TOKEN", token);
                  log.info("JWT Token saved: " + token.substring(0, 20) + "...");
              }
            </stringProp>
          </BeanShellAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- ============================================================ -->
      <!-- PHASE 1: 50 Concurrent Approvals (warm up)                  -->
      <!-- ============================================================ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="[PT-TC02-P1] 50 Concurrent Approvals - Warm Up" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">3</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.comments">Phase 1: Warm-up with 50 concurrent approvals. Checks system handles concurrent writes without Deadlock.</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[PT-TC02] POST approve/${request_id}" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"approvalNotes": "${approver_notes}"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/job-service/recruitment-requests/approve/${request_id}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager - Auth" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${__P(GLOBAL_JWT_TOKEN,)}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
            <stringProp name="TestPlan.comments">REQUIRED: Bearer token from Setup phase. Simulates authenticated Director/Manager approving request.</stringProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert HTTP 200 - Approval Accepted" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="0">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Approval API failed - possible Deadlock or Kafka congestion</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <!-- Check no deadlock error in response -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert NO Deadlock Error" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="0">Deadlock</stringProp>
              <stringProp name="1">deadlock</stringProp>
              <stringProp name="2">Lock wait timeout</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">DEADLOCK detected in response body!</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">6</intProp>
          </ResponseAssertion>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="[NFR] Approval Response &lt; 5000ms" enabled="true">
            <longProp name="DurationAssertion.duration">5000</longProp>
            <stringProp name="TestPlan.comments">Approval includes Kafka async event - allow up to 5s for full processing</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- ============================================================ -->
      <!-- PHASE 2: 100 Concurrent Approvals (full load - NFR target)   -->
      <!-- ============================================================ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="[PT-TC02-P2] 100 Concurrent Approvals - Full Load NFR" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.comments">Phase 2: MAIN TEST - 100 Directors/Managers approve simultaneously. ramp=5s to simulate near-simultaneous clicks. Validates no Deadlock + Kafka throughput.</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[PT-TC02] POST approve/${request_id} - 100 concurrent" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"approvalNotes": "${approver_notes}"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/job-service/recruitment-requests/approve/${request_id}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager - Bearer Auth" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${__P(GLOBAL_JWT_TOKEN,)}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert HTTP 200 - Approval OK" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="0">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Approval failed for request_id=${request_id}</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert NO Deadlock" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="0">Deadlock</stringProp>
              <stringProp name="1">deadlock</stringProp>
              <stringProp name="2">Lock wait timeout</stringProp>
              <stringProp name="3">CannotAcquireLockException</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">DEADLOCK or LOCK TIMEOUT detected!</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">6</intProp>
          </ResponseAssertion>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="[NFR] Approval Response &lt; 5000ms" enabled="true">
            <longProp name="DurationAssertion.duration">5000</longProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- ============================================================ -->
      <!-- LISTENERS                                                    -->
      <!-- ============================================================ -->
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">reports/PT-TC02_summary.csv</stringProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">reports/PT-TC02_aggregate.csv</stringProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>